In [20]:
import pandas as pd
df1=pd.read_csv('student3.csv')
df2=pd.read_csv('student2.csv')

In [5]:
merge_df=pd.merge(df1,df2,on='name',how='outer')
print(merge_df)

    roll_x     name class_x  marks   age_x  roll_y class_y  marks  age_y
0      1.0     anil      TE   56.77   22.0     1.0      TE  56.77   22.0
1      2.0     amit      TE   59.77   21.0     2.0      TE  59.77   21.0
2      3.0   aniket      BE   76.88   19.0     3.0      BE  76.88   19.0
3      4.0  ajinkya      TE   69.66   20.0     4.0      TE  69.66    NaN
4      5.0     asha      TE   63.28    NaN     5.0     NaN  63.28   20.0
5      6.0   ayesha      BE     NaN   20.0     6.0      BE  49.55   20.0
6      7.0     amar      BE   65.34   19.0     7.0      BE    NaN   19.0
7      8.0    Amita      be   68.33   23.0     NaN     NaN    NaN    NaN
8      9.0     amol      TE   56.75   20.0     9.0      TE  56.75   20.0
9      9.0     amol      TE   56.75   20.0     9.0      TE  56.75   20.0
10    10.0    anmol      BE   78.66    NaN    10.0      BE  78.66   21.0
11    11.0   surbhi      TE     NaN   23.0     NaN     NaN    NaN    NaN
12    12.0    Sujay      TE   74.12   22.0     NaN     NaN    NaN    NaN
13    13.0  subhash      be   88.45   21.0     NaN     NaN    NaN    NaN
14    14.0   sachin     NaN   59.33   21.0     NaN     NaN    NaN    NaN
15    15.0  shalini      TE   63.45   20.0     NaN     NaN    NaN    NaN
16     NaN    amita     NaN     NaN    NaN     8.0      BE    NaN   23.0

In [10]:
filtered_df1 = df1[df1['age'] < 30]
print(filtered_df1)

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
5      6   ayesha    BE     NaN  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
9      9     amol    TE   56.75  20.0
11    11   surbhi    TE     NaN  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin   NaN   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [25]:
import random
sample_size = 5
sampled_df = df1.sample(n=sample_size)
rat_col=sampled_df['age']
print(rat_col)

6     19.0
8     20.0
1     21.0
3     20.0
11    23.0
Name: age, dtype: float64

In [24]:
import random
sample_size = 5
sampled_df = df1.sample(n=sample_size)
rat_col=sampled_df['age'] # Use the correct variable name 'sampled_df'
print(rat_col)

15    20.0
7     23.0
5     20.0
1     21.0
3     20.0
Name: age, dtype: float64